In [2]:
import pandas as pd
import seaborn as sns

In [4]:
# Pulling the Titanic dataset into a dataframe
titanic_df = pd.read_csv('https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv')

# Exploratory Data Analysis
print(f"{titanic_df.head()}\n")
print(titanic_df.describe())

   Survived  Pclass                                               Name  \
0         0       3                             Mr. Owen Harris Braund
1         1       1  Mrs. John Bradley (Florence Briggs Thayer) Cum...
2         1       3                              Miss. Laina Heikkinen
3         1       1        Mrs. Jacques Heath (Lily May Peel) Futrelle
4         0       3                            Mr. William Henry Allen

      Sex   Age  Siblings/Spouses Aboard  Parents/Children Aboard     Fare
0    male  22.0                        1                        0   7.2500
1  female  38.0                        1                        0  71.2833
2  female  26.0                        0                        0   7.9250
3  female  35.0                        1                        0  53.1000
4    male  35.0                        0                        0   8.0500

         Survived      Pclass         Age  Siblings/Spouses Aboard  \
count  887.000000  887.000000  887.000000               887.000000
mean     0.385569    2.305524   29.471443                 0.525366
std      0.487004    0.836662   14.121908                 1.104669
min      0.000000    1.000000    0.420000                 0.000000
25%      0.000000    2.000000   20.250000                 0.000000
50%      0.000000    3.000000   28.000000                 0.000000
75%      1.000000    3.000000   38.000000                 1.000000
max      1.000000    3.000000   80.000000                 8.000000

       Parents/Children Aboard       Fare
count               887.000000  887.00000
mean                  0.383315   32.30542
std                   0.807466   49.78204
min                   0.000000    0.00000
25%                   0.000000    7.92500
50%                   0.000000   14.45420
75%                   0.000000   31.13750
max                   6.000000  512.32920

In [5]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB

In [6]:
# Detecting outliers in the data
numeric_cols = titanic_df.select_dtypes(include='number').columns
Q1 = titanic_df[numeric_cols].quantile(0.25)
Q3 = titanic_df[numeric_cols].quantile(0.75)
IQR = Q3 - Q1
print(((titanic_df[numeric_cols] < (Q1 - 1.5 * IQR)) | (titanic_df[numeric_cols] > (Q3 + 1.5 * IQR))).sum())

Survived                     0
Pclass                       0
Age                         13
Siblings/Spouses Aboard     46
Parents/Children Aboard    213
Fare                       116
dtype: int64

In [7]:
titanic_df[titanic_df["Age"] > Q3["Age"] + 1.5 * IQR["Age"]]

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
33,0,2,Mr. Edward H Wheadon,male,66.0,0,0,10.5000
53,0,1,Mr. Engelhart Cornelius Ostby,male,65.0,0,1,61.9792
95,0,1,Mr. George B Goldschmidt,male,71.0,0,0,34.6542
115,0,3,Mr. Patrick Connors,male,70.5,0,0,7.7500
278,0,3,Mr. Frank Duane,male,65.0,0,0,7.7500
453,0,1,Mr. Francis Davis Millet,male,65.0,0,0,26.5500
490,0,1,Mr. Ramon Artagaveytia,male,71.0,0,0,49.5042
508,0,3,Mr. James Webber,male,66.0,0,0,8.0500
535,0,3,Mr. Samuel Beard Risien,male,69.0,0,0,14.5000
627,1,1,Mr. Algernon Henry Wilson Barkworth,male,80.0,0,0,30.0000
669,0,2,Mr. Henry Michael Mitchell,male,70.0,0,0,10.5000
741,0,1,Capt. Edward Gifford Crosby,male,70.0,1,1,71.0000
847,0,3,Mr. Johan Svensson,male,74.0,0,0,7.7750

## 2nd Experiment

> write some code to download the titanic dataset to a dataframe and perform EDA also detect outliers for numeric data data types

In [8]:
import pandas as pd
import seaborn as sns

# Downloading the Titanic dataset
titanic_df = sns.load_dataset('titanic')

# Performing EDA
print(titanic_df.head())
print(titanic_df.describe())

# Detecting outliers for numeric data types
numeric_cols = titanic_df.select_dtypes(include=['float64', 'int64']).columns
for col in numeric_cols:
    q1 = titanic_df[col].quantile(0.25)
    q3 = titanic_df[col].quantile(0.75)
    iqr = q3 - q1
    lower_bound = q1 - (1.5 * iqr)
    upper_bound = q3 + (1.5 * iqr)
    outliers = titanic_df[(titanic_df[col] < lower_bound) | (titanic_df[col] > upper_bound)]
    print(f"Outliers for {col}:")
    print(outliers)

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200
Outliers for survived:
Empty DataFrame
Columns: [survived, pclass, sex, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone]
Index: []
Outliers for pclass:
Empty DataFrame
Columns: [survived, pclass, sex, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone]
Index: []
Outliers for age:
     survived  pclass   sex   age  sibsp  parch     fare embarked   class  \
33          0       2  male  66.0      0      0  10.5000        S  Second
54          0       1  male  65.0      0      1  61.9792        C   First
96          0       1  male  71.0      0      0  34.6542        C   First
116         0       3  male  70.5      0      0   7.7500        Q   Third
280         0       3  male  65.0      0      0   7.7500        Q   Third
456         0       1  male  65.0      0      0  26.5500        S   First
493         0       1  male  71.0      0      0  49.5042        C   First
630         1       1  male  80.0      0      0  30.0000        S   First
672         0       2  male  70.0      0      0  10.5000        S  Second
745         0       1  male  70.0      1      1  71.0000        S   First
851         0       3  male  74.0      0      0   7.7750        S   Third

     who  adult_male deck  embark_town alive  alone
33   man        True  NaN  Southampton    no   True
54   man        True    B    Cherbourg    no  False
96   man        True    A    Cherbourg    no   True
116  man        True  NaN   Queenstown    no   True
280  man        True  NaN   Queenstown    no   True
456  man        True    E  Southampton    no   True
493  man        True  NaN    Cherbourg    no   True
630  man        True    A  Southampton   yes   True
672  man        True  NaN  Southampton    no   True
745  man        True    B  Southampton    no  False
851  man        True  NaN  Southampton    no   True
Outliers for sibsp:
     survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
7           0       3    male   2.0      3      1   21.0750        S   Third
16          0       3    male   2.0      4      1   29.1250        Q   Third
24          0       3  female   8.0      3      1   21.0750        S   Third
27          0       1    male  19.0      3      2  263.0000        S   First
50          0       3    male   7.0      4      1   39.6875        S   Third
59          0       3    male  11.0      5      2   46.9000        S   Third
63          0       3    male   4.0      3      2   27.9000        S   Third
68          1       3  female  17.0      4      2    7.9250        S   Third
71          0       3  female  16.0      5      2   46.9000        S   Third
85          1       3  female  33.0      3      0   15.8500        S   Third
88          1       1  female  23.0      3      2  263.0000        S   First
119         0       3  female   2.0      4      2   31.2750        S   Third
159         0       3    male   NaN      8      2   69.5500        S   Third
164         0       3    male   1.0      4      1   39.6875        S   Third
171         0       3    male   4.0      4      1   29.1250        Q   Third
176         0       3    male   NaN      3      1   25.4667        S   Third
180         0       3  female   NaN      8      2   69.5500        S   Third
182         0       3    male   9.0      4      2   31.3875        S   Third
201         0       3    male   NaN      8      2   69.5500        S   Third
229         0       3  female   NaN      3      1   25.4667        S   Third
233         1       3  female   5.0      4      2   31.3875        S   Third
261         1       3    male   3.0      4      2   31.3875        S   Third
266         0       3    male  16.0      4      1   39.6875        S   Third
278         0       3    male   7.0      4      1   29.1250        Q   Third
324         0       3    male   NaN      8      2   69.5500        S   Third
341         1       1  female  24.0      3      2  263.0000        S   First
374         0       3  female   3.0      3      1   21.0750        S   Third
386         0       3    male   1.0      5      2   46.9000        S   Third
409         0       3  female   NaN      3      1   25.4667        S   Third
480         0       3    male   9.0      5      2   46.9000        S   Third
485         0       3  female   NaN      3      1   25.4667        S   Third
541         0       3  female   9.0      4      2   31.2750        S   Third
542         0       3  female  11.0      4      2   31.2750        S   Third
634         0       3  female   9.0      3      2   27.9000        S   Third
642         0       3  female   2.0      3      2   27.9000        S   Third
683         0       3    male  14.0      5      2   46.9000        S   Third
686         0       3    male  14.0      4      1   39.6875        S   Third
726         1       2  female  30.0      3      0   21.0000        S  Second
787         0       3    male   8.0      4      1   29.1250        Q   Third
792         0       3  female   NaN      8      2   69.5500        S   Third
813         0       3  female   6.0      4      2   31.2750        S   Third
819         0       3    male  10.0      3      2   27.9000        S   Third
824         0       3    male   2.0      4      1   39.6875        S   Third
846         0       3    male   NaN      8      2   69.5500        S   Third
850         0       3    male   4.0      4      2   31.2750        S   Third
863         0       3  female   NaN      8      2   69.5500        S   Third

       who  adult_male deck  embark_town alive  alone
7    child       False  NaN  Southampton    no  False
16   child       False  NaN   Queenstown    no  False
24   child       False  NaN  Southampton    no  False
27     man        True    C  Southampton    no  False
50   child       False  NaN  Southampton    no  False
59   child       False  NaN  Southampton    no  False
63   child       False  NaN  Southampton    no  False
68   woman       False  NaN  Southampton   yes  False
71   woman       False  NaN  Southampton    no  False
85   woman       False  NaN  Southampton   yes  False
88   woman       False    C  Southampton   yes  False
119  child       False  NaN  Southampton    no  False
159    man        True  NaN  Southampton    no  False
164  child       False  NaN  Southampton    no  False
171  child       False  NaN   Queenstown    no  False
176    man        True  NaN  Southampton    no  False
180  woman       False  NaN  Southampton    no  False
182  child       False  NaN  Southampton    no  False
201    man        True  NaN  Southampton    no  False
229  woman       False  NaN  Southampton    no  False
233  child       False  NaN  Southampton   yes  False
261  child       False  NaN  Southampton   yes  False
266    man        True  NaN  Southampton    no  False
278  child       False  NaN   Queenstown    no  False
324    man        True  NaN  Southampton    no  False
341  woman       False    C  Southampton   yes  False
374  child       False  NaN  Southampton    no  False
386  child       False  NaN  Southampton    no  False
409  woman       False  NaN  Southampton    no  False
480  child       False  NaN  Southampton    no  False
485  woman       False  NaN  Southampton    no  False
541  child       False  NaN  Southampton    no  False
542  child       False  NaN  Southampton    no  False
634  child       False  NaN  Southampton    no  False
642  child       False  NaN  Southampton    no  False
683  child       False  NaN  Southampton    no  False
686  child       False  NaN  Southampton    no  False
726  woman       False  NaN  Southampton   yes  False
787  child       False  NaN   Queenstown    no  False
792  woman       False  NaN  Southampton    no  False
813  child       False  NaN  Southampton    no  False
819  child       False  NaN  Southampton    no  False
824  child       False  NaN  Southampton    no  False
846    man        True  NaN  Southampton    no  False
850  child       False  NaN  Southampton    no  False
863  woman       False  NaN  Southampton    no  False
Outliers for parch:
     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
7           0       3    male   2.0      3      1  21.0750        S   Third
8           1       3  female  27.0      0      2  11.1333        S   Third
10          1       3  female   4.0      1      1  16.7000        S   Third
13          0       3    male  39.0      1      5  31.2750        S   Third
16          0       3    male   2.0      4      1  29.1250        Q   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
871         1       1  female  47.0      1      1  52.5542        S   First
879         1       1  female  56.0      0      1  83.1583        C   First
880         1       2  female  25.0      0      1  26.0000        S  Second
885         0       3  female  39.0      0      5  29.1250        Q   Third
888         0       3  female   NaN      1      2  23.4500        S   Third

       who  adult_male deck  embark_town alive  alone
7    child       False  NaN  Southampton    no  False
8    woman       False  NaN  Southampton   yes  False
10   child       False    G  Southampton   yes  False
13     man        True  NaN  Southampton    no  False
16   child       False  NaN   Queenstown    no  False
..     ...         ...  ...          ...   ...    ...
871  woman       False    D  Southampton   yes  False
879  woman       False    C    Cherbourg   yes  False
880  woman       False  NaN  Southampton   yes  False
885  woman       False  NaN   Queenstown    no  False
888  woman       False  NaN  Southampton    no  False

[213 rows x 15 columns]
Outliers for fare:
     survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
1           1       1  female  38.0      1      0   71.2833        C  First
27          0       1    male  19.0      3      2  263.0000        S  First
31          1       1  female   NaN      1      0  146.5208        C  First
34          0       1    male  28.0      1      0   82.1708        C  First
52          1       1  female  49.0      1      0   76.7292        C  First
..        ...     ...     ...   ...    ...    ...       ...      ...    ...
846         0       3    male   NaN      8      2   69.5500        S  Third
849         1       1  female   NaN      1      0   89.1042        C  First
856         1       1  female  45.0      1      1  164.8667        S  First
863         0       3  female   NaN      8      2   69.5500        S  Third
879         1       1  female  56.0      0      1   83.1583        C  First

       who  adult_male deck  embark_town alive  alone
1    woman       False    C    Cherbourg   yes  False
27     man        True    C  Southampton    no  False
31   woman       False    B    Cherbourg   yes  False
34     man        True  NaN    Cherbourg    no  False
52   woman       False    D    Cherbourg   yes  False
..     ...         ...  ...          ...   ...    ...
846    man        True  NaN  Southampton    no  False
849  woman       False    C    Cherbourg   yes  False
856  woman       False  NaN  Southampton   yes  False
863  woman       False  NaN  Southampton    no  False
879  woman       False    C    Cherbourg   yes  False

[116 rows x 15 columns]